INTRODUCAO

In [9]:
nomes =  ['Natalia', 'Sergio', 'Regina', 'Guilherme']
idades = [23, 59, 54, 27]
sexo = ('M', 'F', 'O')
cadastro = {'nomes': nomes, 
            'idades': idades,
            'cidade': ['A', 'B', 'C']}

In [11]:
for nome in nomes:
    print(nome)

Natalia
Sergio
Regina
Guilherme

In [24]:
for idade in idades:
    if idade%2==0: print(idade)

54

In [27]:
for i in range(0,5):
    print(i)

0
1
2
3
4

In [40]:
i = 0
idade = idades[i]
while idade <=30: 
    print(idade)
    i=i+1
    idade = idades [i]

23

COMANDO INLINE

In [8]:
soma = 0
for i in range (0, 101):
    if i %2==0 :
        soma = soma+i
        print(soma)

0
2
6
12
20
30
42
56
72
90
110
132
156
182
210
240
272
306
342
380
420
462
506
552
600
650
702
756
812
870
930
992
1056
1122
1190
1260
1332
1406
1482
1560
1640
1722
1806
1892
1980
2070
2162
2256
2352
2450
2550

In [57]:
sum([i if i%2==0 else 0 for i in range (0,101)])

2550

FUNCAO

In [6]:
import minha_funcao as mf

In [4]:
mf.faixaIdade(10)

'criança'

In [5]:
mf.faixaIdade(65)

'adolescente'

In [7]:
mf.somaQuad(2,4)

20

In [10]:
mf.somaQuad(3,5)

34

RETOMANDO 10/6 - PANDAS

In [30]:
import pandas as pd

In [31]:
df = pd.DataFrame ({'Nome':['Rafael', 'Maria', 'João'],
'Idade': [10,20,30]})
df

     Nome  Idade
0  Rafael     10
1   Maria     20
2    João     30

In [11]:
df.Idade[0]

10

In [12]:
df['Idade'][1]

20

In [14]:
df.loc[1,'Idade']

20

In [17]:
df.Idade.min()

10

In [18]:
df.Idade.mean()

20.0

In [32]:
df.loc[0,'Nome'] = 'Rafael2'
df

      Nome  Idade
0  Rafael2     10
1    Maria     20
2     João     30

In [34]:
df['Sexo'] = ['M', 'F', 'M']
df

      Nome  Idade Sexo
0  Rafael2     10    M
1    Maria     20    F
2     João     30    M

In [35]:
df=df.append({'Nome': 'Ana', 'Idade': 15, 'Sexo': 'F'}, ignore_index=True)
df

      Nome  Idade Sexo
0  Rafael2     10    M
1    Maria     20    F
2     João     30    M
3      Ana     15    F